# Table of Content
01. Import Libraries
02. Import Data
03. Add Remaining Lease Column
04. Data Concatenate
05. Add Additional Row ID Column
06. Export Data

# 01. Import Libraries

In [1]:
# Import libraries
import pandas as pd
import numpy as np
import os

In [2]:
# Adjust setting to allow seeing all the rows in the output of this notebook
pd.options.display.max_rows = None

In [3]:
# Adjust setting to allow seeing all the columns in the output of this notebook
pd.options.display.max_columns = None

# 02. Import Data

In [4]:
# Define the main project folder path
path = r'C:\Users\saich\Desktop\CareerFoundry\Data Immersion\Achievement 6 Advanced Analytics & Dashboard Design\11-2023 HDB Flat Resale Analysis'

### 02.1 Import Flat Resale Data: Jan 1990 ~ Dec 1999

In [5]:
# Import flat resale data from Jan 1990 to Dec 1999
flat_resale_90_99 = pd.read_csv(os.path.join(path, '02 Data', 'Prepared Data', 'flat_resale_90_99 (checked).csv'), index_col = 0)

In [6]:
flat_resale_90_99.head()

,month,town,flat_type,block,street_name,storey_range,floor_area_sqm,flat_model,lease_commence_date,resale_price
0,1990-01-01,ANG MO KIO,1 ROOM,309,ANG MO KIO AVE 1,10 TO 12,31.0,Improved,1977,9000
1,1990-01-01,ANG MO KIO,1 ROOM,309,ANG MO KIO AVE 1,04 TO 06,31.0,Improved,1977,6000
2,1990-01-01,ANG MO KIO,1 ROOM,309,ANG MO KIO AVE 1,10 TO 12,31.0,Improved,1977,8000
3,1990-01-01,ANG MO KIO,1 ROOM,309,ANG MO KIO AVE 1,07 TO 09,31.0,Improved,1977,6000
4,1990-01-01,ANG MO KIO,3 ROOM,216,ANG MO KIO AVE 1,04 TO 06,73.0,New Generation,1976,47200

In [7]:
flat_resale_90_99.shape

(287196, 10)

### 02.2 Import Flat Resale Data: Jan 2000 ~ Feb 2012

In [8]:
# Import flat resale data from Jan 2000 to Feb 2012
flat_resale_00_12 = pd.read_csv(os.path.join(path, '02 Data', 'Prepared Data', 'flat_resale_00_12 (checked).csv'), index_col = 0)

In [9]:
flat_resale_00_12.head()

,month,town,flat_type,block,street_name,storey_range,floor_area_sqm,flat_model,lease_commence_date,resale_price
0,2000-01-01,ANG MO KIO,3 ROOM,170,ANG MO KIO AVE 4,07 TO 09,69.0,Improved,1986,147000.0
1,2000-01-01,ANG MO KIO,3 ROOM,174,ANG MO KIO AVE 4,04 TO 06,61.0,Improved,1986,144000.0
2,2000-01-01,ANG MO KIO,3 ROOM,216,ANG MO KIO AVE 1,07 TO 09,73.0,New Generation,1976,159000.0
3,2000-01-01,ANG MO KIO,3 ROOM,215,ANG MO KIO AVE 1,07 TO 09,73.0,New Generation,1976,167000.0
4,2000-01-01,ANG MO KIO,3 ROOM,218,ANG MO KIO AVE 1,07 TO 09,67.0,New Generation,1976,163000.0

In [10]:
flat_resale_00_12.shape

(369651, 10)

### 02.3 Import Flat Resale Data: Mar 2012 ~ Dec 2014

In [11]:
# Import flat resale data from Mar 2012 to Dec 2014
flat_resale_12_14 = pd.read_csv(os.path.join(path, '02 Data', 'Prepared Data', 'flat_resale_12_14 (checked).csv'), index_col = 0)

In [12]:
flat_resale_12_14.head()

,month,town,flat_type,block,street_name,storey_range,floor_area_sqm,flat_model,lease_commence_date,resale_price
0,2012-03-01,ANG MO KIO,2 ROOM,172,ANG MO KIO AVE 4,07 TO 09,45.0,Improved,1986,250000.0
1,2012-03-01,ANG MO KIO,2 ROOM,510,ANG MO KIO AVE 8,01 TO 03,44.0,Improved,1980,265000.0
2,2012-03-01,ANG MO KIO,3 ROOM,610,ANG MO KIO AVE 4,04 TO 06,68.0,New Generation,1980,315000.0
3,2012-03-01,ANG MO KIO,3 ROOM,474,ANG MO KIO AVE 10,01 TO 03,67.0,New Generation,1984,320000.0
4,2012-03-01,ANG MO KIO,3 ROOM,604,ANG MO KIO AVE 5,07 TO 09,67.0,New Generation,1980,321000.0

In [13]:
flat_resale_12_14.shape

(52203, 10)

### 02.4 Import Flat Resale Data: Jan 2015 ~ Dec 2016

In [14]:
# Import flat resale data from Jan 2015 to Dec 2016
flat_resale_15_16 = pd.read_csv(os.path.join(path, '02 Data', 'Prepared Data', 'flat_resale_15_16 (checked).csv'), index_col = 0)

In [15]:
flat_resale_15_16.head()

,month,town,flat_type,block,street_name,storey_range,floor_area_sqm,flat_model,lease_commence_date,remaining_lease,resale_price
0,2015-01-01,ANG MO KIO,3 ROOM,174,ANG MO KIO AVE 4,07 TO 09,60.0,Improved,1986,70,255000.0
1,2015-01-01,ANG MO KIO,3 ROOM,541,ANG MO KIO AVE 10,01 TO 03,68.0,New Generation,1981,65,275000.0
2,2015-01-01,ANG MO KIO,3 ROOM,163,ANG MO KIO AVE 4,01 TO 03,69.0,New Generation,1980,64,285000.0
3,2015-01-01,ANG MO KIO,3 ROOM,446,ANG MO KIO AVE 10,01 TO 03,68.0,New Generation,1979,63,290000.0
4,2015-01-01,ANG MO KIO,3 ROOM,557,ANG MO KIO AVE 10,07 TO 09,68.0,New Generation,1980,64,290000.0

In [16]:
flat_resale_15_16.shape

(37153, 11)

### 02.5 Import Flat Resale Data: Jan 2017 ~ Dec 2023

In [17]:
# Import flat resale data from Jan 2017 to Dec 2023
flat_resale_17_23 = pd.read_csv(os.path.join(path, '02 Data', 'Prepared Data', 'flat_resale_17_23 (checked).csv'), index_col = 0)

In [18]:
flat_resale_17_23.head()

,month,town,flat_type,block,street_name,storey_range,floor_area_sqm,flat_model,lease_commence_date,remaining_lease,resale_price
0,2017-01-01,ANG MO KIO,2 ROOM,406,ANG MO KIO AVE 10,10 TO 12,44.0,Improved,1979,61 years 04 months,232000.0
1,2017-01-01,ANG MO KIO,3 ROOM,108,ANG MO KIO AVE 4,01 TO 03,67.0,New Generation,1978,60 years 07 months,250000.0
2,2017-01-01,ANG MO KIO,3 ROOM,602,ANG MO KIO AVE 5,01 TO 03,67.0,New Generation,1980,62 years 05 months,262000.0
3,2017-01-01,ANG MO KIO,3 ROOM,465,ANG MO KIO AVE 10,04 TO 06,68.0,New Generation,1980,62 years 01 month,265000.0
4,2017-01-01,ANG MO KIO,3 ROOM,601,ANG MO KIO AVE 5,01 TO 03,67.0,New Generation,1980,62 years 05 months,265000.0

In [19]:
flat_resale_17_23.shape

(169168, 11)

# 03. Add Remaining Lease Column

From the datasets above, we can see that the first three datasets (Jan 1990 ~ Dec 2014) have no 'remaining_lease' column. Then for the remaining two datasets (Jan 2015 ~ Dec 2023), there are two different ways of recording the remaining lease data - remaining years vs remaining years and months. These issues should be handled and aligned for all datasets first before they could be combined into a single dataset. 

- According to HDB as per the link below, HDB flats are sold on 99-year leases. <br>
https://www.hdb.gov.sg/about-us/news-and-publications/publications/hdbspeaks/an-hdb-flat-for-your-different-life-cycle-needs#:~:text=What%20is%20the%20Length%20of%20Lease%20for%20an%20HDB%20flat%3F

- With this information, the remaining lease could be calculated based on the given lease commence date and transaction date. <br>
Example: <br>
lease commence date = 1979 <br>
transaction date = 2017-01 <br>
remaining lease = 99 - (2017 - 1979) = 61 years

- As the lease commence date is given in year only, the remaining lease would be also calculated in year only. To standardize the way of recording data, the remaining lease data in the dataset from Jan 2017 onwards will only keep the year portion. <br>
Example: <br>
61 years 04 months --> 61 years

### 03.1 Calculate Remaining Lease for Flat Resale Data: Jan 1990 ~ Dec 1999

In [20]:
# 1) Extract the year portion into transaction_year column
flat_resale_90_99['transaction_year'] = flat_resale_90_99['month'].str[:4]

In [21]:
flat_resale_90_99.head()

,month,town,flat_type,block,street_name,storey_range,floor_area_sqm,flat_model,lease_commence_date,resale_price,transaction_year
0,1990-01-01,ANG MO KIO,1 ROOM,309,ANG MO KIO AVE 1,10 TO 12,31.0,Improved,1977,9000,1990
1,1990-01-01,ANG MO KIO,1 ROOM,309,ANG MO KIO AVE 1,04 TO 06,31.0,Improved,1977,6000,1990
2,1990-01-01,ANG MO KIO,1 ROOM,309,ANG MO KIO AVE 1,10 TO 12,31.0,Improved,1977,8000,1990
3,1990-01-01,ANG MO KIO,1 ROOM,309,ANG MO KIO AVE 1,07 TO 09,31.0,Improved,1977,6000,1990
4,1990-01-01,ANG MO KIO,3 ROOM,216,ANG MO KIO AVE 1,04 TO 06,73.0,New Generation,1976,47200,1990

In [22]:
# 2) Convert the values in 'transaction_year' column into integer before doing calculation
flat_resale_90_99['transaction_year'] = flat_resale_90_99['transaction_year'].astype('int')

In [23]:
# 3) Calculate the remaining lease
flat_resale_90_99['remaining_lease'] = 99 - (flat_resale_90_99['transaction_year'] - flat_resale_90_99['lease_commence_date'])

In [24]:
# 4) Check the output
flat_resale_90_99.head()

,month,town,flat_type,block,street_name,storey_range,floor_area_sqm,flat_model,lease_commence_date,resale_price,transaction_year,remaining_lease
0,1990-01-01,ANG MO KIO,1 ROOM,309,ANG MO KIO AVE 1,10 TO 12,31.0,Improved,1977,9000,1990,86
1,1990-01-01,ANG MO KIO,1 ROOM,309,ANG MO KIO AVE 1,04 TO 06,31.0,Improved,1977,6000,1990,86
2,1990-01-01,ANG MO KIO,1 ROOM,309,ANG MO KIO AVE 1,10 TO 12,31.0,Improved,1977,8000,1990,86
3,1990-01-01,ANG MO KIO,1 ROOM,309,ANG MO KIO AVE 1,07 TO 09,31.0,Improved,1977,6000,1990,86
4,1990-01-01,ANG MO KIO,3 ROOM,216,ANG MO KIO AVE 1,04 TO 06,73.0,New Generation,1976,47200,1990,85

In [25]:
flat_resale_90_99.shape

(287196, 12)

### 03.2 Calculate Remaining Lease for Flat Resale Data: Jan 2000 ~ Feb 2012

In [26]:
# 1) Extract the year portion into transaction_year column
flat_resale_00_12['transaction_year'] = flat_resale_00_12['month'].str[:4]

In [27]:
flat_resale_00_12.head()

,month,town,flat_type,block,street_name,storey_range,floor_area_sqm,flat_model,lease_commence_date,resale_price,transaction_year
0,2000-01-01,ANG MO KIO,3 ROOM,170,ANG MO KIO AVE 4,07 TO 09,69.0,Improved,1986,147000.0,2000
1,2000-01-01,ANG MO KIO,3 ROOM,174,ANG MO KIO AVE 4,04 TO 06,61.0,Improved,1986,144000.0,2000
2,2000-01-01,ANG MO KIO,3 ROOM,216,ANG MO KIO AVE 1,07 TO 09,73.0,New Generation,1976,159000.0,2000
3,2000-01-01,ANG MO KIO,3 ROOM,215,ANG MO KIO AVE 1,07 TO 09,73.0,New Generation,1976,167000.0,2000
4,2000-01-01,ANG MO KIO,3 ROOM,218,ANG MO KIO AVE 1,07 TO 09,67.0,New Generation,1976,163000.0,2000

In [28]:
# 2) Convert the values in 'transaction_year' column into integer before doing calculation
flat_resale_00_12['transaction_year'] = flat_resale_00_12['transaction_year'].astype('int')

In [29]:
# 3) Calculate the remaining lease
flat_resale_00_12['remaining_lease'] = 99 - (flat_resale_00_12['transaction_year'] - flat_resale_00_12['lease_commence_date'])

In [30]:
# 4) Check the output
flat_resale_00_12.head()

,month,town,flat_type,block,street_name,storey_range,floor_area_sqm,flat_model,lease_commence_date,resale_price,transaction_year,remaining_lease
0,2000-01-01,ANG MO KIO,3 ROOM,170,ANG MO KIO AVE 4,07 TO 09,69.0,Improved,1986,147000.0,2000,85
1,2000-01-01,ANG MO KIO,3 ROOM,174,ANG MO KIO AVE 4,04 TO 06,61.0,Improved,1986,144000.0,2000,85
2,2000-01-01,ANG MO KIO,3 ROOM,216,ANG MO KIO AVE 1,07 TO 09,73.0,New Generation,1976,159000.0,2000,75
3,2000-01-01,ANG MO KIO,3 ROOM,215,ANG MO KIO AVE 1,07 TO 09,73.0,New Generation,1976,167000.0,2000,75
4,2000-01-01,ANG MO KIO,3 ROOM,218,ANG MO KIO AVE 1,07 TO 09,67.0,New Generation,1976,163000.0,2000,75

In [31]:
flat_resale_00_12.shape

(369651, 12)

### 03.3 Calculate Remaining Lease for Flat Resale Data: Mar 2012 ~ Dec 2014

In [32]:
# 1) Extract the year portion into transaction_year column
flat_resale_12_14['transaction_year'] = flat_resale_12_14['month'].str[:4]

In [33]:
flat_resale_12_14.head()

,month,town,flat_type,block,street_name,storey_range,floor_area_sqm,flat_model,lease_commence_date,resale_price,transaction_year
0,2012-03-01,ANG MO KIO,2 ROOM,172,ANG MO KIO AVE 4,07 TO 09,45.0,Improved,1986,250000.0,2012
1,2012-03-01,ANG MO KIO,2 ROOM,510,ANG MO KIO AVE 8,01 TO 03,44.0,Improved,1980,265000.0,2012
2,2012-03-01,ANG MO KIO,3 ROOM,610,ANG MO KIO AVE 4,04 TO 06,68.0,New Generation,1980,315000.0,2012
3,2012-03-01,ANG MO KIO,3 ROOM,474,ANG MO KIO AVE 10,01 TO 03,67.0,New Generation,1984,320000.0,2012
4,2012-03-01,ANG MO KIO,3 ROOM,604,ANG MO KIO AVE 5,07 TO 09,67.0,New Generation,1980,321000.0,2012

In [34]:
# 2) Convert the values in 'transaction_year' column into integer before doing calculation
flat_resale_12_14['transaction_year'] = flat_resale_12_14['transaction_year'].astype('int')

In [35]:
# 3) Calculate the remaining lease
flat_resale_12_14['remaining_lease'] = 99 - (flat_resale_12_14['transaction_year'] - flat_resale_12_14['lease_commence_date'])

In [36]:
# 4) Check the output
flat_resale_12_14.head()

,month,town,flat_type,block,street_name,storey_range,floor_area_sqm,flat_model,lease_commence_date,resale_price,transaction_year,remaining_lease
0,2012-03-01,ANG MO KIO,2 ROOM,172,ANG MO KIO AVE 4,07 TO 09,45.0,Improved,1986,250000.0,2012,73
1,2012-03-01,ANG MO KIO,2 ROOM,510,ANG MO KIO AVE 8,01 TO 03,44.0,Improved,1980,265000.0,2012,67
2,2012-03-01,ANG MO KIO,3 ROOM,610,ANG MO KIO AVE 4,04 TO 06,68.0,New Generation,1980,315000.0,2012,67
3,2012-03-01,ANG MO KIO,3 ROOM,474,ANG MO KIO AVE 10,01 TO 03,67.0,New Generation,1984,320000.0,2012,71
4,2012-03-01,ANG MO KIO,3 ROOM,604,ANG MO KIO AVE 5,07 TO 09,67.0,New Generation,1980,321000.0,2012,67

In [37]:
flat_resale_12_14.shape

(52203, 12)

### 03.4 Calculate Remaining Lease for Flat Resale Data: Jan 2015 ~ Dec 2016

Since the remaining lease is already present and it's in the form we wanted, no calculation is needed for this dataset.

In [38]:
flat_resale_15_16.head()

,month,town,flat_type,block,street_name,storey_range,floor_area_sqm,flat_model,lease_commence_date,remaining_lease,resale_price
0,2015-01-01,ANG MO KIO,3 ROOM,174,ANG MO KIO AVE 4,07 TO 09,60.0,Improved,1986,70,255000.0
1,2015-01-01,ANG MO KIO,3 ROOM,541,ANG MO KIO AVE 10,01 TO 03,68.0,New Generation,1981,65,275000.0
2,2015-01-01,ANG MO KIO,3 ROOM,163,ANG MO KIO AVE 4,01 TO 03,69.0,New Generation,1980,64,285000.0
3,2015-01-01,ANG MO KIO,3 ROOM,446,ANG MO KIO AVE 10,01 TO 03,68.0,New Generation,1979,63,290000.0
4,2015-01-01,ANG MO KIO,3 ROOM,557,ANG MO KIO AVE 10,07 TO 09,68.0,New Generation,1980,64,290000.0

In [39]:
flat_resale_15_16.shape

(37153, 11)

### 03.5 Calculate Remaining Lease for Flat Resale Data: Jan 2017 ~ Dec 2023

Although the remaining lease is present, the values it stores are not in the same way as other datasets. Therefore, recalculation will be performed for data alignment.

In [40]:
# 1) Extract the year portion into transaction_year column
flat_resale_17_23['transaction_year'] = flat_resale_17_23['month'].str[:4]

In [41]:
flat_resale_17_23.head()

,month,town,flat_type,block,street_name,storey_range,floor_area_sqm,flat_model,lease_commence_date,remaining_lease,resale_price,transaction_year
0,2017-01-01,ANG MO KIO,2 ROOM,406,ANG MO KIO AVE 10,10 TO 12,44.0,Improved,1979,61 years 04 months,232000.0,2017
1,2017-01-01,ANG MO KIO,3 ROOM,108,ANG MO KIO AVE 4,01 TO 03,67.0,New Generation,1978,60 years 07 months,250000.0,2017
2,2017-01-01,ANG MO KIO,3 ROOM,602,ANG MO KIO AVE 5,01 TO 03,67.0,New Generation,1980,62 years 05 months,262000.0,2017
3,2017-01-01,ANG MO KIO,3 ROOM,465,ANG MO KIO AVE 10,04 TO 06,68.0,New Generation,1980,62 years 01 month,265000.0,2017
4,2017-01-01,ANG MO KIO,3 ROOM,601,ANG MO KIO AVE 5,01 TO 03,67.0,New Generation,1980,62 years 05 months,265000.0,2017

In [42]:
# 2) Convert the values in 'transaction_year' column into integer before doing calculation
flat_resale_17_23['transaction_year'] = flat_resale_17_23['transaction_year'].astype('int')

In [43]:
# 3) Calculate the remaining lease
flat_resale_17_23['remaining_lease_cal'] = 99 - (flat_resale_17_23['transaction_year'] - flat_resale_17_23['lease_commence_date'])

In [44]:
# 4) Check the output
flat_resale_17_23.head()

,month,town,flat_type,block,street_name,storey_range,floor_area_sqm,flat_model,lease_commence_date,remaining_lease,resale_price,transaction_year,remaining_lease_cal
0,2017-01-01,ANG MO KIO,2 ROOM,406,ANG MO KIO AVE 10,10 TO 12,44.0,Improved,1979,61 years 04 months,232000.0,2017,61
1,2017-01-01,ANG MO KIO,3 ROOM,108,ANG MO KIO AVE 4,01 TO 03,67.0,New Generation,1978,60 years 07 months,250000.0,2017,60
2,2017-01-01,ANG MO KIO,3 ROOM,602,ANG MO KIO AVE 5,01 TO 03,67.0,New Generation,1980,62 years 05 months,262000.0,2017,62
3,2017-01-01,ANG MO KIO,3 ROOM,465,ANG MO KIO AVE 10,04 TO 06,68.0,New Generation,1980,62 years 01 month,265000.0,2017,62
4,2017-01-01,ANG MO KIO,3 ROOM,601,ANG MO KIO AVE 5,01 TO 03,67.0,New Generation,1980,62 years 05 months,265000.0,2017,62

In [45]:
flat_resale_17_23.shape

(169168, 13)

In [46]:
# 5) Verify our remaining lease calculation formula is correct by comparing the calculated and given remaining leases.
flat_resale_17_23['remaining_lease_given'] = flat_resale_17_23['remaining_lease'].str[:2]

In [47]:
flat_resale_17_23['remaining_lease_given'] = flat_resale_17_23['remaining_lease_given'].astype('int')

In [48]:
flat_resale_17_23['delta'] = flat_resale_17_23['remaining_lease_given'] - flat_resale_17_23['remaining_lease_cal']

In [49]:
flat_resale_17_23.head()

,month,town,flat_type,block,street_name,storey_range,floor_area_sqm,flat_model,lease_commence_date,remaining_lease,resale_price,transaction_year,remaining_lease_cal,remaining_lease_given,delta
0,2017-01-01,ANG MO KIO,2 ROOM,406,ANG MO KIO AVE 10,10 TO 12,44.0,Improved,1979,61 years 04 months,232000.0,2017,61,61,0
1,2017-01-01,ANG MO KIO,3 ROOM,108,ANG MO KIO AVE 4,01 TO 03,67.0,New Generation,1978,60 years 07 months,250000.0,2017,60,60,0
2,2017-01-01,ANG MO KIO,3 ROOM,602,ANG MO KIO AVE 5,01 TO 03,67.0,New Generation,1980,62 years 05 months,262000.0,2017,62,62,0
3,2017-01-01,ANG MO KIO,3 ROOM,465,ANG MO KIO AVE 10,04 TO 06,68.0,New Generation,1980,62 years 01 month,265000.0,2017,62,62,0
4,2017-01-01,ANG MO KIO,3 ROOM,601,ANG MO KIO AVE 5,01 TO 03,67.0,New Generation,1980,62 years 05 months,265000.0,2017,62,62,0

In [50]:
flat_resale_17_23['delta'].value_counts(dropna = False)

delta
 0    92629
-1    75953
 1      586
Name: count, dtype: int64

There is a -1/+1 delta between calculated and given remaining lease values. This could be due to the lack of accuracy of using the year portion only in the calculation. Having said that, the calculation formula is correct and consistent since there is no major deviation.

In [51]:
flat_resale_17_23.shape

(169168, 15)

# 04. Data Concatenate

Before we concatenate all the datasets into a single dataset, we have to ensure all the column names are aligned across datasets. Also, unnecessary columns will be dropped. Below are the 11 columns needed in the final single dataset: <br>
- month
- town
- flat_type
- block
- street_name
- storey_range
- floor_area_sqm
- flat_model
- lease_commence_date
- remaining_lease
- resale_price

### 04.1 Prepare for Flat Resale Data: Jan 1990 ~ Dec 1999

In [52]:
flat_resale_90_99.columns

Index(['month', 'town', 'flat_type', 'block', 'street_name', 'storey_range',
       'floor_area_sqm', 'flat_model', 'lease_commence_date', 'resale_price',
       'transaction_year', 'remaining_lease'],
      dtype='object')

In [53]:
# Remove 'transaction_year' from dataset
flat_resale_90_99.drop(columns = ['transaction_year'], inplace = True)

In [54]:
# Verify the changes
flat_resale_90_99.columns

Index(['month', 'town', 'flat_type', 'block', 'street_name', 'storey_range',
       'floor_area_sqm', 'flat_model', 'lease_commence_date', 'resale_price',
       'remaining_lease'],
      dtype='object')

### 04.2 Prepare for Flat Resale Data: Jan 2000 ~ Feb 2012

In [55]:
flat_resale_00_12.columns

Index(['month', 'town', 'flat_type', 'block', 'street_name', 'storey_range',
       'floor_area_sqm', 'flat_model', 'lease_commence_date', 'resale_price',
       'transaction_year', 'remaining_lease'],
      dtype='object')

In [56]:
# Remove 'transaction_year' from dataset
flat_resale_00_12.drop(columns = ['transaction_year'], inplace = True)

In [57]:
# Verify the changes
flat_resale_00_12.columns

Index(['month', 'town', 'flat_type', 'block', 'street_name', 'storey_range',
       'floor_area_sqm', 'flat_model', 'lease_commence_date', 'resale_price',
       'remaining_lease'],
      dtype='object')

### 04.3 Prepare for Flat Resale Data: Mar 2012 ~ Dec 2014

In [58]:
flat_resale_12_14.columns

Index(['month', 'town', 'flat_type', 'block', 'street_name', 'storey_range',
       'floor_area_sqm', 'flat_model', 'lease_commence_date', 'resale_price',
       'transaction_year', 'remaining_lease'],
      dtype='object')

In [59]:
# Remove 'transaction_year' from dataset
flat_resale_12_14.drop(columns = ['transaction_year'], inplace = True)

In [60]:
# Verify the changes
flat_resale_12_14.columns

Index(['month', 'town', 'flat_type', 'block', 'street_name', 'storey_range',
       'floor_area_sqm', 'flat_model', 'lease_commence_date', 'resale_price',
       'remaining_lease'],
      dtype='object')

### 04.4 Prepare for Flat Resale Data: Jan 2015 ~ Dec 2016

In [61]:
flat_resale_15_16.columns

Index(['month', 'town', 'flat_type', 'block', 'street_name', 'storey_range',
       'floor_area_sqm', 'flat_model', 'lease_commence_date',
       'remaining_lease', 'resale_price'],
      dtype='object')

No action is needed.

### 04.5 Prepare for Flat Resale Data: Jan 2017 ~ Dec 2023

In [62]:
flat_resale_17_23.columns

Index(['month', 'town', 'flat_type', 'block', 'street_name', 'storey_range',
       'floor_area_sqm', 'flat_model', 'lease_commence_date',
       'remaining_lease', 'resale_price', 'transaction_year',
       'remaining_lease_cal', 'remaining_lease_given', 'delta'],
      dtype='object')

In [63]:
# Remove unnecessary columns from dataset first
# Note: 'remaining_lease_cal' should be kept instead of 'remaining_lease'

flat_resale_17_23.drop(columns = ['remaining_lease', 'transaction_year', 'remaining_lease_given', 'delta'], inplace = True)

In [64]:
# Rename 'remaining_lease_cal' to 'remaining_lease'
flat_resale_17_23.rename(columns = {'remaining_lease_cal' : 'remaining_lease'}, inplace = True)

In [65]:
# Verify the changes
flat_resale_17_23.columns

Index(['month', 'town', 'flat_type', 'block', 'street_name', 'storey_range',
       'floor_area_sqm', 'flat_model', 'lease_commence_date', 'resale_price',
       'remaining_lease'],
      dtype='object')

### 04.6 Concatenate All Datasets

In [66]:
# Put all the datasets into a list
flat_resale_list = [flat_resale_90_99, flat_resale_00_12, flat_resale_12_14, flat_resale_15_16, flat_resale_17_23]

In [67]:
# Concatenate all the datasets into a single dataset called 'flat_resale'
flat_resale = pd.concat(flat_resale_list)

In [68]:
flat_resale.head()

,month,town,flat_type,block,street_name,storey_range,floor_area_sqm,flat_model,lease_commence_date,resale_price,remaining_lease
0,1990-01-01,ANG MO KIO,1 ROOM,309,ANG MO KIO AVE 1,10 TO 12,31.0,Improved,1977,9000.0,86
1,1990-01-01,ANG MO KIO,1 ROOM,309,ANG MO KIO AVE 1,04 TO 06,31.0,Improved,1977,6000.0,86
2,1990-01-01,ANG MO KIO,1 ROOM,309,ANG MO KIO AVE 1,10 TO 12,31.0,Improved,1977,8000.0,86
3,1990-01-01,ANG MO KIO,1 ROOM,309,ANG MO KIO AVE 1,07 TO 09,31.0,Improved,1977,6000.0,86
4,1990-01-01,ANG MO KIO,3 ROOM,216,ANG MO KIO AVE 1,04 TO 06,73.0,New Generation,1976,47200.0,85

In [69]:
flat_resale.shape

(915371, 11)

In [70]:
# Verify if there are any rows missing during concatenating process
len(flat_resale) == len(flat_resale_90_99) + len(flat_resale_00_12) + len(flat_resale_12_14) + len(flat_resale_15_16) + len(flat_resale_17_23)

True

The number of rows in the final dataset output is equal to the summation of each individual dataset.

# 05. Add Additional Row ID Column

The idea of adding a permanent ID for each row is to allow easier indexing.

In [71]:
# 1) Check the existing index of 'flat_resale'
flat_resale.index

Index([     0,      1,      2,      3,      4,      5,      6,      7,      8,
            9,
       ...
       169158, 169159, 169160, 169161, 169162, 169163, 169164, 169165, 169166,
       169167],
      dtype='int64', length=915371)

The existing index is not proper after concatenation. The last index should be 912062 given the number of rows is 912063.

In [72]:
# 2) Reset the index
# drop = True, will prevent the old index value be stored as a new column
flat_resale.reset_index(drop = True, inplace = True)

In [73]:
# Verify the changes
flat_resale.index

RangeIndex(start=0, stop=915371, step=1)

In [74]:
flat_resale.head()

,month,town,flat_type,block,street_name,storey_range,floor_area_sqm,flat_model,lease_commence_date,resale_price,remaining_lease
0,1990-01-01,ANG MO KIO,1 ROOM,309,ANG MO KIO AVE 1,10 TO 12,31.0,Improved,1977,9000.0,86
1,1990-01-01,ANG MO KIO,1 ROOM,309,ANG MO KIO AVE 1,04 TO 06,31.0,Improved,1977,6000.0,86
2,1990-01-01,ANG MO KIO,1 ROOM,309,ANG MO KIO AVE 1,10 TO 12,31.0,Improved,1977,8000.0,86
3,1990-01-01,ANG MO KIO,1 ROOM,309,ANG MO KIO AVE 1,07 TO 09,31.0,Improved,1977,6000.0,86
4,1990-01-01,ANG MO KIO,3 ROOM,216,ANG MO KIO AVE 1,04 TO 06,73.0,New Generation,1976,47200.0,85

In [75]:
flat_resale.tail()

,month,town,flat_type,block,street_name,storey_range,floor_area_sqm,flat_model,lease_commence_date,resale_price,remaining_lease
915366,2023-12-01,YISHUN,EXECUTIVE,826,YISHUN ST 81,01 TO 03,142.0,Apartment,1988,780000.0,64
915367,2023-12-01,YISHUN,EXECUTIVE,834,YISHUN ST 81,01 TO 03,142.0,Apartment,1988,785000.0,64
915368,2023-01-01,YISHUN,MULTI-GENERATION,666,YISHUN AVE 4,07 TO 09,179.0,Multi Generation,1987,1080000.0,63
915369,2023-12-01,YISHUN,MULTI-GENERATION,666,YISHUN AVE 4,01 TO 03,179.0,Multi Generation,1987,975000.0,63
915370,2023-06-01,YISHUN,MULTI-GENERATION,633,YISHUN ST 61,04 TO 06,159.0,Multi Generation,1987,935000.0,63

In [76]:
# 3) Now the index is correct, create a new column called 'row_id' that starts from 0
flat_resale['row_id'] = flat_resale.index

In [77]:
# Verify the new column 'row_id'
flat_resale.head()

,month,town,flat_type,block,street_name,storey_range,floor_area_sqm,flat_model,lease_commence_date,resale_price,remaining_lease,row_id
0,1990-01-01,ANG MO KIO,1 ROOM,309,ANG MO KIO AVE 1,10 TO 12,31.0,Improved,1977,9000.0,86,0
1,1990-01-01,ANG MO KIO,1 ROOM,309,ANG MO KIO AVE 1,04 TO 06,31.0,Improved,1977,6000.0,86,1
2,1990-01-01,ANG MO KIO,1 ROOM,309,ANG MO KIO AVE 1,10 TO 12,31.0,Improved,1977,8000.0,86,2
3,1990-01-01,ANG MO KIO,1 ROOM,309,ANG MO KIO AVE 1,07 TO 09,31.0,Improved,1977,6000.0,86,3
4,1990-01-01,ANG MO KIO,3 ROOM,216,ANG MO KIO AVE 1,04 TO 06,73.0,New Generation,1976,47200.0,85,4

In [78]:
flat_resale.tail()

,month,town,flat_type,block,street_name,storey_range,floor_area_sqm,flat_model,lease_commence_date,resale_price,remaining_lease,row_id
915366,2023-12-01,YISHUN,EXECUTIVE,826,YISHUN ST 81,01 TO 03,142.0,Apartment,1988,780000.0,64,915366
915367,2023-12-01,YISHUN,EXECUTIVE,834,YISHUN ST 81,01 TO 03,142.0,Apartment,1988,785000.0,64,915367
915368,2023-01-01,YISHUN,MULTI-GENERATION,666,YISHUN AVE 4,07 TO 09,179.0,Multi Generation,1987,1080000.0,63,915368
915369,2023-12-01,YISHUN,MULTI-GENERATION,666,YISHUN AVE 4,01 TO 03,179.0,Multi Generation,1987,975000.0,63,915369
915370,2023-06-01,YISHUN,MULTI-GENERATION,633,YISHUN ST 61,04 TO 06,159.0,Multi Generation,1987,935000.0,63,915370

In [79]:
flat_resale.shape

(915371, 12)

# 06. Export Data

In [80]:
# Export 'flat_resale' to Prepared Data folder 
flat_resale.to_csv(os.path.join(path, '02 Data', 'Prepared Data', 'flat_resale_all.csv'))

In [81]:
flat_resale_90_99.shape

(287196, 11)

In [82]:
# Export 'flat_resale_90_99' to Prepared Data folder 
flat_resale_90_99.to_csv(os.path.join(path, '02 Data', 'Prepared Data', 'flat_resale_90_99 (ready).csv'))

In [83]:
flat_resale_00_12.shape

(369651, 11)

In [84]:
# Export 'flat_resale_00_12' to Prepared Data folder 
flat_resale_00_12.to_csv(os.path.join(path, '02 Data', 'Prepared Data', 'flat_resale_00_12 (ready).csv'))

In [85]:
flat_resale_12_14.shape

(52203, 11)

In [86]:
# Export 'flat_resale_12_14' to Prepared Data folder 
flat_resale_12_14.to_csv(os.path.join(path, '02 Data', 'Prepared Data', 'flat_resale_12_14 (ready).csv'))

In [87]:
flat_resale_15_16.shape

(37153, 11)

In [88]:
# Export 'flat_resale_15_16' to Prepared Data folder 
flat_resale_15_16.to_csv(os.path.join(path, '02 Data', 'Prepared Data', 'flat_resale_15_16 (ready).csv'))

In [89]:
flat_resale_17_23.shape

(169168, 11)

In [90]:
# Export 'flat_resale_17_23' to Prepared Data folder 
flat_resale_17_23.to_csv(os.path.join(path, '02 Data', 'Prepared Data', 'flat_resale_17_23 (ready).csv'))